app/controllers/admin/messages_controller.rb

  def index
    @messages = Message.all
---
SELECT "messages".* FROM "messages"   ORDER BY messagename