app/controllers/admin/users_controller.rb

  def index
    @users = User.order('username')
---
SELECT "users".* FROM "users"   ORDER BY username

  def create
    @user = User.new(params.require(:user).permit!)
  if @user.save
---
INSERT INTO "users" ("created_at", "email", "password", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-08-06 22:15:28.114943"], ["email", "tom@jones.com"], ["password", "12345678"], ["updated_at", "2014-08-06 22:15:28.114943"], ["username", "tomjones"]]