app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save
---
INSERT INTO "messages" ("created_at", "text", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-08-04 21:19:21.722767"], ["text", "Test message user 1"], ["updated_at", "2014-08-04 21:19:21.722767"], ["user_id", "1"]]

  def update
    respond_to do |format|
      if @message.update(message_params)
---
UPDATE "messages" SET "updated_at" = $1, "user_id" = $2 WHERE "messages"."id" = 1  [["updated_at", "2014-08-07 17:36:10.161377"], ["user_id", "3"]]