app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "password", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-07-26 23:02:35.611551"], ["email", "Sean.flaherty@gmail.com"], ["password", "password"], ["updated_at", "2014-07-26 23:02:35.611551"], ["username", "Sean"]]